/** ЗАДАЧА 10 - Комментарий перед функцией
 *
 * 1. Объявите функцию с двумя параметрами, значения которых - числа
 *
 * 2. Эта функция должна возвращать разницу между первым и вторым параметром
 *
 * 3. Добавьте многострочный комментарий перед функцией:
 *  - Текст комментария "Возвращает разницу двух чисел"
 *  - Укажите тип параметров - number
 *  - Укажите тип возвращаемого значения - number
 *  - Опишите возвращаемое значение - "Разница чисел"
 *
 * 4. Вызовите функцию
 */

// let a 
// let b


// /* "Возвращает разницу двух чисел" */ 
// function myFn() {
//     a=15 /* nummber */ 
//     b=10 /* nummber */
//     c=a-b
//     console.log(c)
// }

// myFn()

/* "Возвращает разницу двух чисел" */ 
/* 
a = nummber 
b = nummber 
*/

function diff (a, b) {
    return a-b /* Разница чисел */
}

const result = diff(15, 10)
console.log(result)

